app/controllers/players_controller.rb

  def create
    @player = Player.new(params[:player])

    respond_to do |format|
      if @player.save
---
INSERT INTO "players" ("atbats", "created_at", "games", "givenname", "hitbypitch", "hits", "pb", "rbi", "runs", "struckout", "surname", "updated_at", "walks") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"